**Домашнее задание**

**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

**Задание 2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

**Задание 3**
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [45]:
import pandas as pd

In [46]:
# Задание 1
# данные из 'ml-latest-small'
ratings = pd.read_csv('ratings.csv')
movies = pd.read_csv('movies.csv')

In [47]:
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [49]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [50]:
movies['title'][movies.movieId == ratings[(ratings.rating == 5.0)].movieId.value_counts().index[0]].values[0]

'Shawshank Redemption, The (1994)'

In [51]:
# Задание 2
data = pd.read_csv('power.csv')
# ищем как записаны страны
data[ data['country'].str.contains('Lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [52]:
data[ data['country'].str.contains('Lit', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [53]:
data[ data['country'].str.contains('Esto', case=False) ]['country'].unique()

array(['Estonia'], dtype=object)

In [54]:
Sorted = data[((data['country']=='Latvia')|(data['country']=='Lithuania') |(data['country']=='Estonia'))]
Sorted = Sorted[ (Sorted.category == 4) | (Sorted.category == 12)| (Sorted.category == 21)]
Sorted[ (Sorted.year >= 2005) | (Sorted.year <= 2010)].head(1300)

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10618     Estonia  2007       0.0         4
10619     Estonia  2006       0.0         4
10620     Estonia  2005       1.0         4
10621     Estonia  2004       1.0         4
...           ...   ...       ...       ...
253986  Lithuania  2005       1.0        21
253987  Lithuania  2004       1.0        21
253988  Lithuania  2003       0.0        21
253989  Lithuania  2002       0.0        21
253990  Lithuania  2001       0.0        21

[1253 rows x 4 columns]

In [55]:
# Задание 3
pd.read_html('https://fortrader.org/quotes')[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  89.42       0.20          0.23        NaN
1       USDRUB Курс рубля к доллару  73.74       0.17          0.22        NaN